import React from 'react';

import gif from '../images/player/playing-gif.gif';

function SongContainer() {

    return (
        <>
            <h3 className='player__text'>Текст песни:</h3>
            <p className='player__text player__text_type_song'>Подошел, значит Вячеслав к своему автомобилю. Открыл багажник. Достал из багажника шаровары. Примерил. Ай, какие шаровары! Из синего шёлка, с начёсом, с бархатными помпонами, да с золотыми драконами на пуговицах. Смотрит Вячеслав, не нарадуется на свои шаровары, как вдруг, краем глаза замечает,
что из багажника вываливаются гурьбой маленькие медвежата с балалаечками. Обступают Вячеслава со всех сторон, играют на балалаечках, подмигивают и поют:
 
Шаровары Вячеслава, шаровары Вячеслава
 
Шаровары Вячеслава, тай-да-дай-да-да…
 
М-да, думает Вячеслав, однако… Медвежата… И откуда же они такие взялись в моём багажнике? А пойду-ка я пожалуй в дом – чаю попить…
И вот заходит Вячеслав в дом, присаживается на скамеечку, наливает себе чаю, тянеттся, как и положено, к сахарнице, но тут с удивлением подмечает,
что из сахарницы вываливаются гурьбой на обеденный стол, ну да… - те самые маленькие медвежата с балалаечками. Обступают Вячеслава со всех сторон, играют на балалаечках, подмигивают и поют:
 
Шаровары Вячеслава, шаровары Вячеслава
Шаровары Вячеслава, тай-да-дай-да-да…
 
Тут уж, конечно, не до шуток. Свет что ли клином сошелся на этих треклятых шароварах? Да и спать, к тому же пора…
Ну, что было ночью, я даже рассказывать не буду. А только с утра Вячеслав с распухшей от медвежьих песен головой, первым делом отправился на рынок, да и продал за бесценок свои красивые шаровары какому-то неулыбчивому таджику.
А вечером, развалившись перед телевизором, с рюмкой коньяка, хотел было Вячеслав криминальные новости посмотреть, как вдруг, краем глаза заметил,
что из книжного шкафа вываливаются гурьбой ну да… - все те же маленькие медвежата с балалаечками. Более того, на одном из медвежат, Вячеслав с негодованием опознал напяленные кое-как, да ещё и наизнанку, его, Вячеслава, шаровары с помпонами и драконами на пуговицах! А медвежата, знай себе, тренькают на балалаечках, подмигивают и поют ехидными голосами:
 
Шаровары Вячеслава, шаровары Вячеслава
Шаровары Вячеслава, тай-да-дай-да-да…
 
И стало Вячеславу вдруг как-то очень даже весело. Ну думает, глупость какая – медвежата, балалаечки, песенка какая-то дикая. А может и не издеваются над ним медвежата, может наоборот, пытаются привлечь к себе внимание? Ну да, и голоса у них вроде бы есть, и в терцию могут петь, и на три голоса, и акапелла, и в ноты попадают. А шаровары… да бог с ними, с шароварами, ну поедет Вячеслав куда-нибудь в Персию, напросится в гости к падишаху, а падишах от чистого сердца преподнесет Вячеславу в подарок новые красивые шаровары, удобные, шелковистые, а ежели хорошо попросить, то может быть и вовсе – волшебные!
И вот с такими приятными мыслями Вячеслав спокойно заснул и целую ночь ему снились маленькие медвежата с балалаечками, и во сне Вячеслав курил вместе с ними гашиш, подмигивал и пел:
 
Шаровары Вячеслава, шаровары Вячеслава
Шаровары Вячеслава, тай-да-дай-да-да…</p>
        </>
    );
}

export default SongContainer;